Working with pandas data

In [136]:
import pandas as pd
import datetime

In [137]:
# create a list called dt containing dates from 12-01 to 12-07
dt = datetime.datetime(2015,12,1)
end = datetime.datetime(2015,12,8)
step = datetime.timedelta(days=1)
dates = []
# printing dates returns empty dataset
print dates

[]

In [138]:
# populate the list
# creating dates from dt 
while dt < end:
    dates.append(dt.strftime('%m-%d'))
    dt += step

In [139]:
# "print dates" and "dates" output is the same
dates

['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07']

In [140]:
d = {'Date': dates, 'Osaka' : [15,19,15,11,9,8,13], 'Brussells': [-2,0,2,5,7,-5,-3], 'Bombay':[20,18,23,19,25,27,23]}

In [141]:
d

{'Bombay': [20, 18, 23, 19, 25, 27, 23],
 'Brussells': [-2, 0, 2, 5, 7, -5, -3],
 'Date': ['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07'],
 'Osaka': [15, 19, 15, 11, 9, 8, 13]}

Example 1: Create Dataframe Object from a Python Dictionary of equal length lists

In [142]:
temps = pd.DataFrame(d)

In [143]:
ntemp = temps['Bombay']

In [144]:
ntemp

0    20
1    18
2    23
3    19
4    25
5    27
6    23
Name: Bombay, dtype: int64

indexing dataframe by dates

In [145]:
temps = temps.set_index('Date')

In [146]:
temps

       Bombay  Brussells  Osaka
Date
12-01      20         -2     15
12-02      18          0     19
12-03      23          2     15
12-04      19          5     11
12-05      25          7      9
12-06      27         -5      8
12-07      23         -3     13

Example 2 : Create DataFrame Object by reading a .csv file (Titanic passengers)

In [59]:
titanic = pd.read_csv('../data/titanic.csv')

In [66]:
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [67]:
titanic.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

Example 3 : Create DataFrame call it "medals" Object by reading a .csv file (Olympic Medalists)

In [68]:
medals=pd.read_csv('../data/olympicmedals.csv')

In [69]:
medals.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [70]:
medals.Sport.value_counts()

Aquatics             3828
Athletics            3448
Rowing               2523
Gymnastics           2214
Fencing              1547
Football             1387
Hockey               1325
Wrestling            1140
Shooting             1105
Sailing              1061
Cycling              1025
Canoe / Kayak        1002
Basketball            940
Volleyball            910
Equestrian            894
Handball              886
Boxing                842
Weightlifting         548
Judo                  435
Baseball              335
Archery               305
Tennis                272
Rugby                 192
Softball              180
Modern Pentathlon     174
Badminton             120
Table Tennis          120
Tug of War             94
Taekwondo              80
Polo                   66
Lacrosse               59
Golf                   30
Skating                27
Ice Hockey             27
Cricket                24
Triathlon              18
Rackets                10
Croquet                 8
Water Motorsports       5
Basque Pelota           4
Roque                   3
Jeu de paume            3
Name: Sport, dtype: int64

Getting Started with pandas

In [77]:
import pandas as pd

In [78]:
from pandas import Series, DataFrame

In [79]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

Introduction to pandas Data Structures

Series

In [83]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [84]:
obj.values
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [85]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [86]:
obj2['a']
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [87]:
obj2[obj2 > 0]
obj2 * 2
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [89]:
'b' in obj2

True

In [90]:
'e' in obj2

False

In [91]:
'b' in obj2
'e' in obj2

False

In [92]:
print 'b' in obj2
print 'e' in obj2

True
False

In [93]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [94]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [95]:
pd.isnull(obj4)
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [96]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [97]:
obj3
obj4
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [98]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [99]:
obj
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

Summarizing and Computing Descriptive Statistics

In [100]:
df = pd.DataFrame([[2.4, np.nan], [8.1, -5.5],
                   [np.nan, np.nan], [1.75, -2.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  2.40  NaN
b  8.10 -5.5
c   NaN  NaN
d  1.75 -2.3

In [101]:
df.sum()

one    12.25
two    -7.80
dtype: float64

In [105]:
#() is equivalent to (axis='rows') ... the default is row sums
df.sum(axis='rows')

one    12.25
two    -7.80
dtype: float64

In [106]:
df.sum(axis='columns')

a    2.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [107]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [108]:
df.describe()

            one       two
count  3.000000  2.000000
mean   4.083333 -3.900000
std    3.493685  2.262742
min    1.750000 -5.500000
25%    2.075000 -4.700000
50%    2.400000 -3.900000
75%    5.250000 -3.100000
max    8.100000 -2.300000

Correlation and Covariance

In [109]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['BNS', 'RBC', 'TD', 'CM']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [120]:
returns = price.pct_change()
returns.tail(6)

                 BNS        CM       RBC        TD
Date
2017-11-08  0.004120  0.003008  0.015717  0.002088
2017-11-09  0.002128 -0.000555 -0.007737 -0.000521
2017-11-10 -0.005308 -0.005779  0.005198 -0.004169
2017-11-13 -0.003812 -0.006819 -0.012282 -0.002791
2017-11-14 -0.000765 -0.005065 -0.011780  0.001050
2017-11-15 -0.001991 -0.000226 -0.022517 -0.002272

In [125]:
returns.BNS.corr(returns.RBC)

0.51875558535818345

In [126]:
returns.BNS.cov(returns.RBC)

0.00011236221591973643

In [127]:
returns.corr()
returns.cov()

          BNS        CM       RBC        TD
BNS  0.000152  0.000121  0.000112  0.000124
CM   0.000121  0.000138  0.000101  0.000116
RBC  0.000112  0.000101  0.000308  0.000109
TD   0.000124  0.000116  0.000109  0.000138